
## Plan Result

[CI link](https://github.com/hikobend/aws-sample-architecture-1/actions/runs/5301834257)


<pre><code>Plan: 23 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.network.module.network.aws_default_network_acl.this[0]
  * module.network.module.network.aws_default_route_table.default[0]
  * module.network.module.network.aws_default_security_group.this[0]
  * module.network.module.network.aws_eip.nat[0]
  * module.network.module.network.aws_eip.nat[1]
  * module.network.module.network.aws_internet_gateway.this[0]
  * module.network.module.network.aws_nat_gateway.this[0]
  * module.network.module.network.aws_nat_gateway.this[1]
  * module.network.module.network.aws_route.private_nat_gateway[0]
  * module.network.module.network.aws_route.private_nat_gateway[1]
  * module.network.module.network.aws_route.public_internet_gateway[0]
  * module.network.module.network.aws_route_table.private[0]
  * module.network.module.network.aws_route_table.private[1]
  * module.network.module.network.aws_route_table.public[0]
  * module.network.module.network.aws_route_table_association.private[0]
  * module.network.module.network.aws_route_table_association.private[1]
  * module.network.module.network.aws_route_table_association.public[0]
  * module.network.module.network.aws_route_table_association.public[1]
  * module.network.module.network.aws_subnet.private[0]
  * module.network.module.network.aws_subnet.private[1]
  * module.network.module.network.aws_subnet.public[0]
  * module.network.module.network.aws_subnet.public[1]
  * module.network.module.network.aws_vpc.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.network.module.network.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "-default"
        }
      + tags_all               = {
          + "Name" = "-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.network.module.network.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "-default"
        }
      + tags_all               = {
          + "Name" = "-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.network.module.network.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "-default"
        }
      + tags_all               = {
          + "Name" = "-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.module.network.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Env"  = "dev"
          + "Name" = "-ap-northeast-1a"
        }
      + tags_all             = {
          + "Env"  = "dev"
          + "Name" = "-ap-northeast-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.network.module.network.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Env"  = "dev"
          + "Name" = "-ap-northeast-1c"
        }
      + tags_all             = {
          + "Env"  = "dev"
          + "Name" = "-ap-northeast-1c"
        }
      + vpc                  = (known after apply)
    }

  # module.network.module.network.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Env"  = "dev"
          + "Name" = ""
        }
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.network.module.network.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Env"  = "dev"
          + "Name" = "-ap-northeast-1a"
        }
      + tags_all             = {
          + "Env"  = "dev"
          + "Name" = "-ap-northeast-1a"
        }
    }

  # module.network.module.network.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Env"  = "dev"
          + "Name" = "-ap-northeast-1c"
        }
      + tags_all             = {
          + "Env"  = "dev"
          + "Name" = "-ap-northeast-1c"
        }
    }

  # module.network.module.network.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.module.network.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.module.network.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.module.network.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Env"  = "dev"
          + "Name" = "-private-ap-northeast-1a"
        }
      + tags_all         = {
          + "Env"  = "dev"
          + "Name" = "-private-ap-northeast-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.network.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Env"  = "dev"
          + "Name" = "-private-ap-northeast-1c"
        }
      + tags_all         = {
          + "Env"  = "dev"
          + "Name" = "-private-ap-northeast-1c"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.network.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Env"  = "dev"
          + "Name" = "-public"
        }
      + tags_all         = {
          + "Env"  = "dev"
          + "Name" = "-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.network.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.network.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.network.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.network.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.network.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "dev"
          + "Name" = "dev-private-subnet-1a"
        }
      + tags_all                                       = {
          + "Env"  = "dev"
          + "Name" = "dev-private-subnet-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.network.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "dev"
          + "Name" = "dev-private-subnet-1c"
        }
      + tags_all                                       = {
          + "Env"  = "dev"
          + "Name" = "dev-private-subnet-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.network.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "dev"
          + "Name" = "dev-public-subnet-1a"
        }
      + tags_all                                       = {
          + "Env"  = "dev"
          + "Name" = "dev-public-subnet-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.network.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "dev"
          + "Name" = "dev-public-subnet-1c"
        }
      + tags_all                                       = {
          + "Env"  = "dev"
          + "Name" = "dev-public-subnet-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.network.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Env"  = "dev"
          + "Name" = "dev-vpc"
        }
      + tags_all                             = {
          + "Env"  = "dev"
          + "Name" = "dev-vpc"
        }
    }

Plan: 23 to add, 0 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.network.module.network.aws_eip.nat[0] has been deleted
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-0236ce6f9d1ce54cd" -> null
      - association_id       = "eipassoc-04382d1b65470a523" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0236ce6f9d1ce54cd" -> null
      - network_border_group = "ap-northeast-1" -> null
      - network_interface    = "eni-071b713a87343cf2d" -> null
      - private_dns          = "ip-10-0-1-9.ap-northeast-1.compute.internal" -> null
      - private_ip           = "10.0.1.9" -> null
      - public_dns           = "ec2-54-168-148-10.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip            = "54.168.148.10" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Env"  = "dev"
          - "Name" = "-ap-northeast-1a"
        } -> null
      - tags_all             = {
          - "Env"  = "dev"
          - "Name" = "-ap-northeast-1a"
        } -> null
      - vpc                  = true -> null
    }

  # module.network.module.network.aws_eip.nat[1] has been deleted
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-048cbb83d727dde53" -> null
      - association_id       = "eipassoc-0f14d6c74f6c5c6c4" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-048cbb83d727dde53" -> null
      - network_border_group = "ap-northeast-1" -> null
      - network_interface    = "eni-05231ce83367fe128" -> null
      - private_dns          = "ip-10-0-2-86.ap-northeast-1.compute.internal" -> null
      - private_ip           = "10.0.2.86" -> null
      - public_dns           = "ec2-175-41-241-131.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip            = "175.41.241.131" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Env"  = "dev"
          - "Name" = "-ap-northeast-1c"
        } -> null
      - tags_all             = {
          - "Env"  = "dev"
          - "Name" = "-ap-northeast-1c"
        } -> null
      - vpc                  = true -> null
    }

  # module.network.module.network.aws_internet_gateway.this[0] has been deleted
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:ap-northeast-1:021077554300:internet-gateway/igw-067497d82f241cd31" -> null
      - id       = "igw-067497d82f241cd31" -> null
        tags     = {
            "Env"  = "dev"
            "Name" = ""
        }
        # (3 unchanged attributes hidden)
    }

  # module.network.module.network.aws_nat_gateway.this[0] has been deleted
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-0236ce6f9d1ce54cd" -> null
      - association_id       = "eipassoc-04382d1b65470a523" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-0011a4e47b0afbf31" -> null
      - network_interface_id = "eni-071b713a87343cf2d" -> null
      - private_ip           = "10.0.1.9" -> null
      - public_ip            = "54.168.148.10" -> null
      - subnet_id            = "subnet-08102e74e2e54d3eb" -> null
      - tags                 = {
          - "Env"  = "dev"
          - "Name" = "-ap-northeast-1a"
        } -> null
      - tags_all             = {
          - "Env"  = "dev"
          - "Name" = "-ap-northeast-1a"
        } -> null
    }

  # module.network.module.network.aws_nat_gateway.this[1] has been deleted
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-048cbb83d727dde53" -> null
      - association_id       = "eipassoc-0f14d6c74f6c5c6c4" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-03891e04b04f94bb4" -> null
      - network_interface_id = "eni-05231ce83367fe128" -> null
      - private_ip           = "10.0.2.86" -> null
      - public_ip            = "175.41.241.131" -> null
      - subnet_id            = "subnet-090abd0d4982be388" -> null
      - tags                 = {
          - "Env"  = "dev"
          - "Name" = "-ap-northeast-1c"
        } -> null
      - tags_all             = {
          - "Env"  = "dev"
          - "Name" = "-ap-northeast-1c"
        } -> null
    }

  # module.network.module.network.aws_route.private_nat_gateway[0] has been deleted
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0dbb2fb7c13a0abaf1080289494" -> null
      - nat_gateway_id         = "nat-0011a4e47b0afbf31" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0dbb2fb7c13a0abaf" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.network.module.network.aws_route.private_nat_gateway[1] has been deleted
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0f1b805d0af8ef4671080289494" -> null
      - nat_gateway_id         = "nat-03891e04b04f94bb4" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0f1b805d0af8ef467" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.network.module.network.aws_route.public_internet_gateway[0] has been deleted
  - resource "aws_route" "public_internet_gateway" {
      - id                     = "r-rtb-01b5723cd2a5ec5201080289494" -> null
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.network.module.network.aws_route_table.private[0] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:ap-northeast-1:021077554300:route-table/rtb-0dbb2fb7c13a0abaf" -> null
      - id               = "rtb-0dbb2fb7c13a0abaf" -> null
      - owner_id         = "021077554300" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0011a4e47b0afbf31"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Env"  = "dev"
          - "Name" = "-private-ap-northeast-1a"
        } -> null
      - tags_all         = {
          - "Env"  = "dev"
          - "Name" = "-private-ap-northeast-1a"
        } -> null
      - vpc_id           = "vpc-0e4e9c5896482113d" -> null
    }

  # module.network.module.network.aws_route_table.private[1] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:ap-northeast-1:021077554300:route-table/rtb-0f1b805d0af8ef467" -> null
      - id               = "rtb-0f1b805d0af8ef467" -> null
      - owner_id         = "021077554300" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-03891e04b04f94bb4"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Env"  = "dev"
          - "Name" = "-private-ap-northeast-1c"
        } -> null
      - tags_all         = {
          - "Env"  = "dev"
          - "Name" = "-private-ap-northeast-1c"
        } -> null
      - vpc_id           = "vpc-0e4e9c5896482113d" -> null
    }

  # module.network.module.network.aws_route_table.public[0] has been deleted
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:ap-northeast-1:021077554300:route-table/rtb-01b5723cd2a5ec520" -> null
      - id               = "rtb-01b5723cd2a5ec520" -> null
      - owner_id         = "021077554300" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-067497d82f241cd31"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Env"  = "dev"
          - "Name" = "-public"
        } -> null
      - tags_all         = {
          - "Env"  = "dev"
          - "Name" = "-public"
        } -> null
      - vpc_id           = "vpc-0e4e9c5896482113d" -> null
    }

  # module.network.module.network.aws_route_table_association.private[0] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-06348561137caa7a2" -> null
      - route_table_id = "rtb-0dbb2fb7c13a0abaf" -> null
      - subnet_id      = "subnet-03f23c238393fd77f" -> null
    }

  # module.network.module.network.aws_route_table_association.private[1] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0720cec1fe9841ce2" -> null
      - route_table_id = "rtb-0f1b805d0af8ef467" -> null
      - subnet_id      = "subnet-007e4e17fa7a60550" -> null
    }

  # module.network.module.network.aws_route_table_association.public[0] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0384f0516bc3e56ff" -> null
      - route_table_id = "rtb-01b5723cd2a5ec520" -> null
      - subnet_id      = "subnet-08102e74e2e54d3eb" -> null
    }

  # module.network.module.network.aws_route_table_association.public[1] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0d475f94b3e979477" -> null
      - route_table_id = "rtb-01b5723cd2a5ec520" -> null
      - subnet_id      = "subnet-090abd0d4982be388" -> null
    }

  # module.network.module.network.aws_subnet.private[0] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:ap-northeast-1:021077554300:subnet/subnet-03f23c238393fd77f" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-northeast-1a" -> null
      - availability_zone_id                           = "apne1-az4" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-03f23c238393fd77f" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "021077554300" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Env"  = "dev"
          - "Name" = "dev-private-subnet-1a"
        } -> null
      - tags_all                                       = {
          - "Env"  = "dev"
          - "Name" = "dev-private-subnet-1a"
        } -> null
      - vpc_id                                         = "vpc-0e4e9c5896482113d" -> null
    }

  # module.network.module.network.aws_subnet.private[1] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:ap-northeast-1:021077554300:subnet/subnet-007e4e17fa7a60550" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-northeast-1c" -> null
      - availability_zone_id                           = "apne1-az1" -> null
      - cidr_block                                     = "10.0.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-007e4e17fa7a60550" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "021077554300" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Env"  = "dev"
          - "Name" = "dev-private-subnet-1c"
        } -> null
      - tags_all                                       = {
          - "Env"  = "dev"
          - "Name" = "dev-private-subnet-1c"
        } -> null
      - vpc_id                                         = "vpc-0e4e9c5896482113d" -> null
    }

  # module.network.module.network.aws_subnet.public[0] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:ap-northeast-1:021077554300:subnet/subnet-08102e74e2e54d3eb" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-northeast-1a" -> null
      - availability_zone_id                           = "apne1-az4" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-08102e74e2e54d3eb" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "021077554300" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Env"  = "dev"
          - "Name" = "dev-public-subnet-1a"
        } -> null
      - tags_all                                       = {
          - "Env"  = "dev"
          - "Name" = "dev-public-subnet-1a"
        } -> null
      - vpc_id                                         = "vpc-0e4e9c5896482113d" -> null
    }

  # module.network.module.network.aws_subnet.public[1] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:ap-northeast-1:021077554300:subnet/subnet-090abd0d4982be388" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-northeast-1c" -> null
      - availability_zone_id                           = "apne1-az1" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-090abd0d4982be388" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "021077554300" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Env"  = "dev"
          - "Name" = "dev-public-subnet-1c"
        } -> null
      - tags_all                                       = {
          - "Env"  = "dev"
          - "Name" = "dev-public-subnet-1c"
        } -> null
      - vpc_id                                         = "vpc-0e4e9c5896482113d" -> null
    }

  # module.network.module.network.aws_vpc.this[0] has been deleted
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:ap-northeast-1:021077554300:vpc/vpc-0e4e9c5896482113d" -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0ff801aa2eaacc911" -> null
      - default_route_table_id               = "rtb-0928b9af7c1b57c77" -> null
      - default_security_group_id            = "sg-0a80ffa76ded2ae99" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - id                                   = "vpc-0e4e9c5896482113d" -> null
      - instance_tenancy                     = "default" -> null
      - main_route_table_id                  = "rtb-0928b9af7c1b57c77" -> null
      - owner_id                             = "021077554300" -> null
        tags                                 = {
            "Env"  = "dev"
            "Name" = "dev-vpc"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":23,"Program":"tfcmt","SHA1":"913fcd8809c8c5a9995f4efd4835c192ccf40d19","Vars":{},"WorkflowName":"terraform plan"} -->